// Версия конфигурации.
version : 7

// Значения по умолчанию.
config : {

    // Является ли текущий индекс ротации постоянным? Если true, ротация продолжится после перезапуска сервера,
    // Если false, ротация всегда начнется с первой настройки.
    // Вы всегда можете удалить файл sms_rotate_data.json из lua_config, чтобы сбросить сохраненный индекс.
    "persist_index" : true,

    // Значения по умолчанию для настройки. Это таблица с атрибутами и значениями. Следующие правила применяются к атрибутам:
    // - Если указано TrackId: трасса, которую необходимо установить. Автоматически устанавливает 1 для ServerControlsTrack
    // - Если указано VehicleModelId: автомобиль, который необходимо установить. Автоматически устанавливает 1 для ServerControlsVehicle, устанавливает FORCE_IDENTICAL_VEHICLES в Flags
    // - Если указано VehicleClassId: класс, который необходимо установить. Автоматически устанавливает 1 для ServerControlsVehicleClass, устанавливает FORCE_SAME_VEHICLE_CLASS в Flags
    // - Трасса, модель автомобиля, класс и все атрибуты enum/flags могут использовать значения в строковом виде — так что можно использовать либо id трассы, либо название.
    // - Flags в виде строки могут содержать несколько флагов, разделенных запятой, например "ABS_ALLOWED,SC_ALLOWED,TCS_ALLOWED"
    // - В настройке не должно быть никаких атрибутов, начинающихся с "ServerControls", они определяются автоматически.
    // - В настройке не должно одновременно присутствовать VehicleModelId и VehicleClassId. Укажите либо класс, либо конкретный автомобиль.
    // - Атрибут Flags не должен содержать FORCE_IDENTICAL_VEHICLES или FORCE_SAME_VEHICLE_CLASS, эти флаги определяются автоматически.
    "default" : {
        "PracticeLength" : 10,
        "QualifyLength" : 10,
        "RaceLength" : 10,

        "Flags" : "ALLOW_CUSTOM_VEHICLE_SETUP,ABS_ALLOWED,SC_ALLOWED,TCS_ALLOWED,FORCE_REALISTIC_DRIVING_AIDS,FILL_SESSION_WITH_AI,AUTO_START_ENGINE,TIMED_RACE,PIT_SPEED_LIMITER",
        "DamageType" : "FULL",
        "TireWearType" : "STANDARD",
        "FuelUsageType" : "STANDARD",
        "PenaltiesType" : "FULL",
        "AllowedViews" : "Same Class",

        "RaceDateHour" : 15,

        "RaceWeatherSlots" : 1,
        "RaceWeatherSlot1" : "Clear",
        "RaceWeatherSlot2" : "Clear",
        "RaceWeatherSlot3" : "Clear",
        "RaceWeatherSlot4" : "Clear",
    },

    // Ротация. Массив настроек для последовательной смены. Если он пустой, будет использована только настройка по умолчанию без ротации.
    //
    // Эти настройки применяются поверх настроек по умолчанию, затем к игре. Предыдущая настройка в ротации никогда не используется.
    // Например, если вы хотите повторять одну и ту же трассу в нескольких последовательных настройках, отличных от настроек по умолчанию,
    // каждую из них нужно явно включить эту трассу. Также не забывайте, что кроме флагов, ничего не может быть "удалено" из настроек по умолчанию,
    // поэтому если в настройках по умолчанию есть трасса, она всегда будет принудительно установлена (или по умолчанию, или конкретная для настройки).
    // И еще одно: эти переопределяющие настройки никогда не могут содержать атрибут, которого нет в настройках по умолчанию — они могут только перекрывать некоторые из них, но не добавлять новые. Исключение — атрибуты трассы/автомобиля/класса.
    //
    // Атрибуты в этих настройках могут иметь специальный атрибут RemoveFlags, который удалит указанные флаги из настроек по умолчанию вместо их добавления.
    "rotation" : [
        {
            "TrackId" : "Nordschleife_2020_24hr",
            "VehicleClassId" : "StockCarV8",
        },
        {
            "VehicleClassId" : "SprintRace",
            "TrackId" : "Londrina Long",
            // Формула C на Silverstone с глупыми настройками времени/погоды. Квалификация 10 минут, гонка 5 кругов.
            // переопределите время начала и длину гонки
            "RaceLength" : 8,
            "RaceDateHour" : 17,
            
            // установите погоду для этого события
            "RaceWeatherSlots" : 4,
            "RaceWeatherSlot1" : "Clear",
            "RaceWeatherSlot2" : "MediumCloud",
            "RaceWeatherSlot3" : "Storm",
            "RaceWeatherSlot4" : "LightCloud",
        }
    ]
}
